Revit 2027 API
InitialLuminousIntensity Constructor
Overload List
Name | Description
InitialLuminousIntensity(Double) |  Creates an initial luminous intensity object with the given document and luminosity values.
InitialLuminousIntensity(InitialLuminousIntensity) |  Creates a copy of the given initial luminous intensity object
Top
See Also
Reference
InitialLuminousIntensity Class
Autodesk.Revit.DB.Lighting Namespace